dev/Server/test/stress/res.txt
Started phase 0 (stress_phase), duration: 300s @ 22:22:14(+0300) 2021-06-16
Report @ 22:22:24(+0300) 2021-06-16
Elapsed time: 30 seconds
  Scenarios launched:  1
  Scenarios completed: 0
  Requests completed:  2
  Mean response/sec: 0.59
  Response time (msec):
    min: 73.3
    max: 812.3
    median: 442.8
    p95: 812.3
    p99: 812.3
  Codes:
    200: 2

Report @ 22:22:34(+0300) 2021-06-16
Elapsed time: 40 seconds
  Scenarios launched:  3
  Scenarios completed: 2
  Requests completed:  8
  Mean response/sec: 0.86
  Response time (msec):
    min: 2.4
    max: 23.7
    median: 13.6
    p95: 23.7
    p99: 23.7
  Codes:
    200: 8

Report @ 22:22:44(+0300) 2021-06-16
Elapsed time: 50 seconds
  Scenarios launched:  9
  Scenarios completed: 8
  Requests completed:  36
  Mean response/sec: 3.79
  Response time (msec):
    min: 1.3
    max: 142.2
    median: 13.2
    p95: 31.6
    p99: 142.2
  Codes:
    200: 36

Report @ 22:22:54(+0300) 2021-06-16
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  4
  Scenarios completed: 3
  Requests completed:  14
  Mean response/sec: 1.48
  Response time (msec):
    min: 1.3
    max: 23.2
    median: 13
    p95: 22.9
    p99: 23.2
  Codes:
    200: 14

Report @ 22:23:04(+0300) 2021-06-16
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  16
  Scenarios completed: 12
  Requests completed:  59
  Mean response/sec: 6.01
  Response time (msec):
    min: 1.2
    max: 120.2
    median: 14.8
    p95: 69.6
    p99: 119.4
  Codes:
    200: 59

Report @ 22:23:14(+0300) 2021-06-16
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  21
  Scenarios completed: 20
  Requests completed:  77
  Mean response/sec: 7.76
  Response time (msec):
    min: 1.2
    max: 23.5
    median: 13.1
    p95: 21.4
    p99: 23.3
  Codes:
    200: 77

Report @ 22:23:24(+0300) 2021-06-16
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  11
  Scenarios completed: 16
  Requests completed:  55
  Mean response/sec: 5.56
  Response time (msec):
    min: 1.1
    max: 43.1
    median: 10.7
    p95: 32.4
    p99: 42.9
  Codes:
    200: 55

Report @ 22:23:34(+0300) 2021-06-16
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  14
  Scenarios completed: 7
  Requests completed:  43
  Mean response/sec: 4.46
  Response time (msec):
    min: 1.1
    max: 25.8
    median: 14.9
    p95: 25
    p99: 25.8
  Codes:
    200: 43

Report @ 22:23:44(+0300) 2021-06-16
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  33
  Scenarios completed: 21
  Requests completed:  106
  Mean response/sec: 10.76
  Response time (msec):
    min: 1.1
    max: 36.8
    median: 13.4
    p95: 31.7
    p99: 36.7
  Codes:
    200: 106

Report @ 22:23:54(+0300) 2021-06-16
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  26
  Scenarios completed: 35
  Requests completed:  131
  Mean response/sec: 13.01
  Response time (msec):
    min: 1.2
    max: 246.5
    median: 13.4
    p95: 152.5
    p99: 244
  Codes:
    200: 131

Report @ 22:24:04(+0300) 2021-06-16
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  39
  Scenarios completed: 29
  Requests completed:  130
  Mean response/sec: 13.05
  Response time (msec):
    min: 1.2
    max: 83.6
    median: 14.1
    p95: 45.6
    p99: 76
  Codes:
    200: 130

Report @ 22:24:14(+0300) 2021-06-16
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  30
  Scenarios completed: 33
  Requests completed:  121
  Mean response/sec: 12.27
  Response time (msec):
    min: 1.2
    max: 84
    median: 13.2
    p95: 29.4
    p99: 83.8
  Codes:
    200: 121

Report @ 22:24:24(+0300) 2021-06-16
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  54
  Scenarios completed: 44
  Requests completed:  203
  Mean response/sec: 20.3
  Response time (msec):
    min: 1.1
    max: 71.6
    median: 13.9
    p95: 30.1
    p99: 42.4
  Codes:
    200: 203

Report @ 22:24:34(+0300) 2021-06-16
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  56
  Scenarios completed: 54
  Requests completed:  209
  Mean response/sec: 21.24
  Response time (msec):
    min: 1.1
    max: 48.1
    median: 14.6
    p95: 31.7
    p99: 44.7
  Codes:
    200: 209

Report @ 22:24:44(+0300) 2021-06-16
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  78
  Scenarios completed: 59
  Requests completed:  282
  Mean response/sec: 28.44
  Response time (msec):
    min: 1.1
    max: 72.2
    median: 14.1
    p95: 33.4
    p99: 55
  Codes:
    200: 282

Report @ 22:24:54(+0300) 2021-06-16
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  68
  Scenarios completed: 81
  Requests completed:  290
  Mean response/sec: 29.28
  Response time (msec):
    min: 1
    max: 52.6
    median: 12.1
    p95: 24.4
    p99: 40.3
  Codes:
    200: 290

Report @ 22:25:04(+0300) 2021-06-16
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  107
  Scenarios completed: 78
  Requests completed:  378
  Mean response/sec: 37.84
  Response time (msec):
    min: 1
    max: 56.5
    median: 16.3
    p95: 37.4
    p99: 51.1
  Codes:
    200: 378

Report @ 22:25:14(+0300) 2021-06-16
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  125
  Scenarios completed: 122
  Requests completed:  490
  Mean response/sec: 49.1
  Response time (msec):
    min: 1
    max: 70
    median: 15.5
    p95: 36.1
    p99: 64.8
  Codes:
    200: 490

Report @ 22:25:24(+0300) 2021-06-16
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  154
  Scenarios completed: 138
  Requests completed:  604
  Mean response/sec: 60.7
  Response time (msec):
    min: 1
    max: 58.5
    median: 15.7
    p95: 37.1
    p99: 46.6
  Codes:
    200: 604

Report @ 22:25:34(+0300) 2021-06-16
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  229
  Scenarios completed: 178
  Requests completed:  811
  Mean response/sec: 81.53
  Response time (msec):
    min: 1.1
    max: 746.7
    median: 28.5
    p95: 254.9
    p99: 577.3
  Codes:
    200: 811

Report @ 22:25:44(+0300) 2021-06-16
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  256
  Scenarios completed: 232
  Requests completed:  927
  Mean response/sec: 94.21
  Response time (msec):
    min: 1.1
    max: 496.9
    median: 40.7
    p95: 273.6
    p99: 434.1
  Codes:
    200: 927

Warning: 
CPU usage of Artillery seems to be very high (pids: 18692)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:25:54(+0300) 2021-06-16
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  161
  Scenarios completed: 191
  Requests completed:  727
  Mean response/sec: 72.19
  Response time (msec):
    min: 1.1
    max: 1729.3
    median: 73.5
    p95: 1311.8
    p99: 1598
  Codes:
    200: 727

Report @ 22:26:04(+0300) 2021-06-16
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  275
  Scenarios completed: 229
  Requests completed:  996
  Mean response/sec: 100
  Response time (msec):
    min: 1.2
    max: 495.1
    median: 31.8
    p95: 285.5
    p99: 381.5
  Codes:
    200: 996

Report @ 22:26:14(+0300) 2021-06-16
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  362
  Scenarios completed: 283
  Requests completed:  1283
  Mean response/sec: 134.07
  Response time (msec):
    min: 1.2
    max: 753
    median: 169.2
    p95: 512.3
    p99: 600
  Codes:
    200: 1283

Report @ 22:26:24(+0300) 2021-06-16
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  422
  Scenarios completed: 329
  Requests completed:  1387
  Mean response/sec: 149.65
  Response time (msec):
    min: 1.3
    max: 2309.2
    median: 561.4
    p95: 1698
    p99: 1918
  Codes:
    200: 1387

Report @ 22:26:34(+0300) 2021-06-16
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  230
  Scenarios completed: 348
  Requests completed:  1209
  Mean response/sec: 112.32
  Response time (msec):
    min: 2
    max: 4951.6
    median: 716.4
    p95: 4043.5
    p99: 4479.8
  Codes:
    200: 1209

Report @ 22:26:44(+0300) 2021-06-16
Elapsed time: 4 minutes, 50 seconds
  Scenarios launched:  384
  Scenarios completed: 253
  Requests completed:  1348
  Mean response/sec: 140.74
  Response time (msec):
    min: 2.5
    max: 3647.3
    median: 516.8
    p95: 2945.9
    p99: 3519.5
  Codes:
    200: 1348

Report @ 22:26:54(+0300) 2021-06-16
Elapsed time: 5 minutes, 0 seconds
  Scenarios launched:  482
  Scenarios completed: 396
  Requests completed:  1586
  Mean response/sec: 164.83
  Response time (msec):
    min: 2.8
    max: 3371.4
    median: 869.8
    p95: 1873.2
    p99: 1958.5
  Codes:
    200: 1586

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:27:04(+0300) 2021-06-16
Elapsed time: 5 minutes, 10 seconds
  Scenarios launched:  386
  Scenarios completed: 332
  Requests completed:  1385
  Mean response/sec: 141.78
  Response time (msec):
    min: 1.3
    max: 4219.2
    median: 1535.4
    p95: 3267.7
    p99: 3862.5
  Codes:
    200: 1385

Report @ 22:27:14(+0300) 2021-06-16
Elapsed time: 5 minutes, 20 seconds
  Scenarios launched:  423
  Scenarios completed: 191
  Requests completed:  1123
  Mean response/sec: 143.94
  Response time (msec):
    min: 1.5
    max: 4810.4
    median: 2449.6
    p95: 4150.2
    p99: 4740.6
  Codes:
    200: 1123
  Errors:
    ESOCKETTIMEDOUT: 88

Report @ 22:27:24(+0300) 2021-06-16
Elapsed time: 5 minutes, 31 seconds
  Scenarios launched:  404
  Scenarios completed: 128
  Requests completed:  769
  Mean response/sec: 110.69
  Response time (msec):
    min: 13
    max: 5818.9
    median: 2970.4
    p95: 5660.5
    p99: 5785.3
  Codes:
    200: 769
  Errors:
    ESOCKETTIMEDOUT: 468

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:27:34(+0300) 2021-06-16
Elapsed time: 5 minutes, 40 seconds
  Scenarios launched:  569
  Scenarios completed: 0
  Requests completed:  767
  Mean response/sec: 131.95
  Response time (msec):
    min: 3861.2
    max: 5217.2
    median: 4535.5
    p95: 4982.4
    p99: 5040.9
  Codes:
    200: 767
  Errors:
    ESOCKETTIMEDOUT: 186

Report @ 22:27:44(+0300) 2021-06-16
Elapsed time: 5 minutes, 51 seconds
  Scenarios launched:  305
  Scenarios completed: 0
  Requests completed:  675
  Mean response/sec: 103.18
  Response time (msec):
    min: 2357.2
    max: 6917.7
    median: 4172.3
    p95: 6077.7
    p99: 6178.4
  Codes:
    200: 675
  Errors:
    ESOCKETTIMEDOUT: 345

Report @ 22:27:54(+0300) 2021-06-16
Elapsed time: 6 minutes, 1 second
  Scenarios launched:  507
  Scenarios completed: 0
  Requests completed:  532
  Mean response/sec: 108.64
  Response time (msec):
    min: 3005
    max: 5522
    median: 4541.2
    p95: 4976
    p99: 5020.2
  Codes:
    200: 532
  Errors:
    ESOCKETTIMEDOUT: 714

Report @ 22:28:04(+0300) 2021-06-16
Elapsed time: 6 minutes, 11 seconds
  Scenarios launched:  432
  Scenarios completed: 0
  Requests completed:  802
  Mean response/sec: 103.01
  Response time (msec):
    min: 1979
    max: 6392.4
    median: 4005.8
    p95: 5004.6
    p99: 6331.7
  Codes:
    200: 802
  Errors:
    ESOCKETTIMEDOUT: 565

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:28:14(+0300) 2021-06-16
Elapsed time: 6 minutes, 21 seconds
  Scenarios launched:  517
  Scenarios completed: 7
  Requests completed:  760
  Mean response/sec: 118.15
  Response time (msec):
    min: 20.8
    max: 6269.6
    median: 3921.7
    p95: 5161.1
    p99: 5362.8
  Codes:
    200: 760
  Errors:
    ESOCKETTIMEDOUT: 403

Report @ 22:28:25(+0300) 2021-06-16
Elapsed time: 6 minutes, 31 seconds
  Scenarios launched:  540
  Scenarios completed: 100
  Requests completed:  1035
  Mean response/sec: 156.61
  Response time (msec):
    min: 29.6
    max: 4955.4
    median: 3037
    p95: 4583.6
    p99: 4874.5
  Codes:
    200: 1035
  Errors:
    ESOCKETTIMEDOUT: 242

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:28:35(+0300) 2021-06-16
Elapsed time: 6 minutes, 41 seconds
  Scenarios launched:  752
  Scenarios completed: 0
  Requests completed:  279
  Mean response/sec: 123.98
  Response time (msec):
    min: 3256.1
    max: 5227.4
    median: 3977
    p95: 4939.1
    p99: 5194.8
  Codes:
    200: 279
  Errors:
    ESOCKETTIMEDOUT: 1066

Report @ 22:28:45(+0300) 2021-06-16
Elapsed time: 6 minutes, 51 seconds
  Scenarios launched:  603
  Scenarios completed: 0
  Requests completed:  718
  Mean response/sec: 90.11
  Response time (msec):
    min: 1291.1
    max: 5792.5
    median: 4503.4
    p95: 5224.2
    p99: 5742.9
  Codes:
    200: 718
  Errors:
    ESOCKETTIMEDOUT: 379

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:28:55(+0300) 2021-06-16
Elapsed time: 7 minutes, 1 second
  Scenarios launched:  546
  Scenarios completed: 23
  Requests completed:  964
  Mean response/sec: 179.11
  Response time (msec):
    min: 12.6
    max: 5368.5
    median: 1467.2
    p95: 5051.4
    p99: 5335.9
  Codes:
    200: 964
  Errors:
    ESOCKETTIMEDOUT: 521

Report @ 22:29:05(+0300) 2021-06-16
Elapsed time: 7 minutes, 11 seconds
  Scenarios launched:  778
  Scenarios completed: 3
  Requests completed:  10
  Mean response/sec: 91
  Response time (msec):
    min: 631.8
    max: 5082.8
    median: 5039.4
    p95: 5082.8
    p99: 5082.8
  Codes:
    200: 10
  Errors:
    ESOCKETTIMEDOUT: 1162

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:29:15(+0300) 2021-06-16
Elapsed time: 7 minutes, 21 seconds
  Scenarios launched:  756
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 75.7
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 704

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:29:25(+0300) 2021-06-16
Elapsed time: 7 minutes, 31 seconds
  Scenarios launched:  782
  Scenarios completed: 0
  Requests completed:  1313
  Mean response/sec: 183.07
  Response time (msec):
    min: 309.1
    max: 5395.3
    median: 2847.7
    p95: 3804.6
    p99: 4022.2
  Codes:
    200: 1313

Report @ 22:29:35(+0300) 2021-06-16
Elapsed time: 7 minutes, 41 seconds
  Scenarios launched:  602
  Scenarios completed: 0
  Requests completed:  374
  Mean response/sec: 120.67
  Response time (msec):
    min: 3917.9
    max: 5808.7
    median: 4831.2
    p95: 5650.4
    p99: 5774.7
  Codes:
    200: 374
  Errors:
    ESOCKETTIMEDOUT: 1145

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:29:45(+0300) 2021-06-16
Elapsed time: 7 minutes, 51 seconds
  Scenarios launched:  775
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 79.84
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 1081

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:29:55(+0300) 2021-06-16
Elapsed time: 8 minutes, 1 second
  Scenarios launched:  980
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 98.1
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 756

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:30:06(+0300) 2021-06-16
Elapsed time: 8 minutes, 12 seconds
  Scenarios launched:  627
  Scenarios completed: 0
  Requests completed:  1427
  Mean response/sec: 180.87
  Response time (msec):
    min: 37.2
    max: 5722.3
    median: 4041.5
    p95: 5274.5
    p99: 5616.2
  Codes:
    200: 1427
  Errors:
    ESOCKETTIMEDOUT: 178

Report @ 22:30:16(+0300) 2021-06-16
Elapsed time: 8 minutes, 22 seconds
  Scenarios launched:  735
  Scenarios completed: 0
  Requests completed:  205
  Mean response/sec: 108.73
  Response time (msec):
    min: 1517.9
    max: 5571.1
    median: 1751.5
    p95: 5336.8
    p99: 5483
  Codes:
    200: 205
  Errors:
    ESOCKETTIMEDOUT: 1381

Report @ 22:30:26(+0300) 2021-06-16
Elapsed time: 8 minutes, 32 seconds
  Scenarios launched:  913
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 89.78
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 640

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:30:36(+0300) 2021-06-16
Elapsed time: 8 minutes, 42 seconds
  Scenarios launched:  591
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 68.45
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 817

Report @ 22:30:46(+0300) 2021-06-16
Elapsed time: 8 minutes, 52 seconds
  Scenarios launched:  770
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 78.75
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 834

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:30:56(+0300) 2021-06-16
Elapsed time: 9 minutes, 2 seconds
  Scenarios launched:  654
  Scenarios completed: 0
  Requests completed:  775
  Mean response/sec: 131.6
  Response time (msec):
    min: 22.8
    max: 5090.1
    median: 3339
    p95: 4980.4
    p99: 5066.4
  Codes:
    200: 775
  Errors:
    ESOCKETTIMEDOUT: 216

Report @ 22:31:06(+0300) 2021-06-16
Elapsed time: 9 minutes, 12 seconds
  Scenarios launched:  682
  Scenarios completed: 0
  Requests completed:  730
  Mean response/sec: 152.65
  Response time (msec):
    min: 2568.4
    max: 6098.8
    median: 3831.1
    p95: 5830.9
    p99: 6016.8
  Codes:
    200: 730
  Errors:
    ESOCKETTIMEDOUT: 477

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:31:16(+0300) 2021-06-16
Elapsed time: 9 minutes, 22 seconds
  Scenarios launched:  787
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 78.21
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 1330

Report @ 22:31:26(+0300) 2021-06-16
Elapsed time: 9 minutes, 32 seconds
  Scenarios launched:  828
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 85.27
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 914

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:31:36(+0300) 2021-06-16
Elapsed time: 9 minutes, 42 seconds
  Scenarios launched:  921
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 91.64
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 725

Report @ 22:31:47(+0300) 2021-06-16
Elapsed time: 9 minutes, 53 seconds
  Scenarios launched:  580
  Scenarios completed: 0
  Requests completed:  1072
  Mean response/sec: 138.85
  Response time (msec):
    min: 29.6
    max: 5799.4
    median: 3253
    p95: 5037.7
    p99: 5737.1
  Codes:
    200: 1072
  Errors:
    ESOCKETTIMEDOUT: 330

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:31:57(+0300) 2021-06-16
Elapsed time: 10 minutes, 3 seconds
  Scenarios launched:  723
  Scenarios completed: 0
  Requests completed:  275
  Mean response/sec: 112.18
  Response time (msec):
    min: 3472.8
    max: 5139.6
    median: 4325.9
    p95: 5063
    p99: 5120.1
  Codes:
    200: 275
  Errors:
    ESOCKETTIMEDOUT: 1171

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:32:07(+0300) 2021-06-16
Elapsed time: 10 minutes, 13 seconds
  Scenarios launched:  909
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 91.54
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 820

Report @ 22:32:17(+0300) 2021-06-16
Elapsed time: 10 minutes, 23 seconds
  Scenarios launched:  845
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 84.6
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 735

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:32:27(+0300) 2021-06-16
Elapsed time: 10 minutes, 33 seconds
  Scenarios launched:  882
  Scenarios completed: 0
  Requests completed:  640
  Mean response/sec: 133.91
  Response time (msec):
    min: 2591
    max: 5063.1
    median: 3906.7
    p95: 4906.1
    p99: 5011.4
  Codes:
    200: 640
  Errors:
    ESOCKETTIMEDOUT: 584

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:32:37(+0300) 2021-06-16
Elapsed time: 10 minutes, 43 seconds
  Scenarios launched:  691
  Scenarios completed: 0
  Requests completed:  1198
  Mean response/sec: 196.4
  Response time (msec):
    min: 2712.8
    max: 5981.4
    median: 4185.7
    p95: 4883.4
    p99: 5006.2
  Codes:
    200: 1198
  Errors:
    ESOCKETTIMEDOUT: 53

Report @ 22:32:47(+0300) 2021-06-16
Elapsed time: 10 minutes, 53 seconds
  Scenarios launched:  687
  Scenarios completed: 0
  Requests completed:  3
  Mean response/sec: 81.34
  Response time (msec):
    min: 5069.7
    max: 5230.7
    median: 5078.7
    p95: 5230.7
    p99: 5230.7
  Codes:
    200: 3
  Errors:
    ESOCKETTIMEDOUT: 1676

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:32:57(+0300) 2021-06-16
Elapsed time: 11 minutes, 3 seconds
  Scenarios launched:  856
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 89.09
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 1005

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:33:07(+0300) 2021-06-16
Elapsed time: 11 minutes, 13 seconds
  Scenarios launched:  881
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 88.09
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 635

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:33:17(+0300) 2021-06-16
Elapsed time: 11 minutes, 23 seconds
  Scenarios launched:  649
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 64.9
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 864

Report @ 22:33:27(+0300) 2021-06-16
Elapsed time: 11 minutes, 33 seconds
  Scenarios launched:  896
  Scenarios completed: 0
  Requests completed:  218
  Mean response/sec: 90.4
  Response time (msec):
    min: 4834.3
    max: 5053.6
    median: 4930.7
    p95: 5035.1
    p99: 5050
  Codes:
    200: 218
  Errors:
    ESOCKETTIMEDOUT: 631

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:33:37(+0300) 2021-06-16
Elapsed time: 11 minutes, 43 seconds
  Scenarios launched:  590
  Scenarios completed: 0
  Requests completed:  841
  Mean response/sec: 158.1
  Response time (msec):
    min: 1674.9
    max: 5671.3
    median: 3698.3
    p95: 5035.8
    p99: 5299
  Codes:
    200: 841
  Errors:
    ESOCKETTIMEDOUT: 189

Report @ 22:33:47(+0300) 2021-06-16
Elapsed time: 11 minutes, 54 seconds
  Scenarios launched:  805
  Scenarios completed: 0
  Requests completed:  86
  Mean response/sec: 94.96
  Response time (msec):
    min: 3855
    max: 5037
    median: 4642.1
    p95: 5014.1
    p99: 5033.1
  Codes:
    200: 86
  Errors:
    ESOCKETTIMEDOUT: 1233

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:33:57(+0300) 2021-06-16
Elapsed time: 12 minutes, 4 seconds
  Scenarios launched:  592
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 60.04
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 908

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:34:07(+0300) 2021-06-16
Elapsed time: 12 minutes, 14 seconds
  Scenarios launched:  764
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 77.66
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 793

Report @ 22:34:17(+0300) 2021-06-16
Elapsed time: 12 minutes, 24 seconds
  Scenarios launched:  902
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 90.09
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 627

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:34:27(+0300) 2021-06-16
Elapsed time: 12 minutes, 34 seconds
  Scenarios launched:  580
  Scenarios completed: 0
  Requests completed:  393
  Mean response/sec: 91.2
  Response time (msec):
    min: 479.5
    max: 5101.6
    median: 2863.1
    p95: 4998.4
    p99: 5076.7
  Codes:
    200: 393
  Errors:
    ESOCKETTIMEDOUT: 451

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:34:37(+0300) 2021-06-16
Elapsed time: 12 minutes, 44 seconds
  Scenarios launched:  529
  Scenarios completed: 68
  Requests completed:  801
  Mean response/sec: 130.53
  Response time (msec):
    min: 111.9
    max: 6302.4
    median: 3753.4
    p95: 5877.3
    p99: 5929.2
  Codes:
    200: 801
  Errors:
    ESOCKETTIMEDOUT: 191

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:34:48(+0300) 2021-06-16
Elapsed time: 12 minutes, 54 seconds
  Scenarios launched:  752
  Scenarios completed: 0
  Requests completed:  18
  Mean response/sec: 79.16
  Response time (msec):
    min: 4656.7
    max: 5206.1
    median: 4788.6
    p95: 5199.3
    p99: 5206.1
  Codes:
    200: 18
  Errors:
    ESOCKETTIMEDOUT: 1240

Report @ 22:34:58(+0300) 2021-06-16
Elapsed time: 13 minutes, 4 seconds
  Scenarios launched:  661
  Scenarios completed: 0
  Requests completed:  808
  Mean response/sec: 82.62
  Response time (msec):
    min: 46.5
    max: 7344.6
    median: 4161.3
    p95: 5559.8
    p99: 5736.8
  Codes:
    200: 808
  Errors:
    ESOCKETTIMEDOUT: 365

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:35:08(+0300) 2021-06-16
Elapsed time: 13 minutes, 14 seconds
  Scenarios launched:  490
  Scenarios completed: 0
  Requests completed:  240
  Mean response/sec: 135.35
  Response time (msec):
    min: 348.3
    max: 5211.4
    median: 2490.9
    p95: 4371.5
    p99: 4450.3
  Codes:
    200: 240
  Errors:
    ESOCKETTIMEDOUT: 621

Report @ 22:35:18(+0300) 2021-06-16
Elapsed time: 13 minutes, 24 seconds
  Scenarios launched:  597
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 62.68
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 788

Report @ 22:35:28(+0300) 2021-06-16
Elapsed time: 13 minutes, 34 seconds
  Scenarios launched:  130
  Scenarios completed: 0
  Requests completed:  2
  Mean response/sec: 13.57
  Response time (msec):
    min: 5793.2
    max: 5794.8
    median: 5794
    p95: 5794.8
    p99: 5794.8
  Codes:
    200: 2
  Errors:
    ESOCKETTIMEDOUT: 441

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:35:38(+0300) 2021-06-16
Elapsed time: 13 minutes, 45 seconds
  Scenarios launched:  612
  Scenarios completed: 0
  Requests completed:  802
  Mean response/sec: 119.71
  Response time (msec):
    min: 522.2
    max: 6804.3
    median: 3383.4
    p95: 4322.7
    p99: 4762
  Codes:
    200: 802

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:35:48(+0300) 2021-06-16
Elapsed time: 13 minutes, 55 seconds
  Scenarios launched:  681
  Scenarios completed: 2
  Requests completed:  196
  Mean response/sec: 105.9
  Response time (msec):
    min: 66.2
    max: 5072.5
    median: 3249.8
    p95: 4489.5
    p99: 5070.7
  Codes:
    200: 196
  Errors:
    ESOCKETTIMEDOUT: 1025

Report @ 22:35:58(+0300) 2021-06-16
Elapsed time: 14 minutes, 5 seconds
  Scenarios launched:  928
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 91.78
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 714

Report @ 22:36:08(+0300) 2021-06-16
Elapsed time: 14 minutes, 15 seconds
  Scenarios launched:  625
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 66.77
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 698

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:36:19(+0300) 2021-06-16
Elapsed time: 14 minutes, 25 seconds
  Scenarios launched:  731
  Scenarios completed: 0
  Requests completed:  842
  Mean response/sec: 92.85
  Response time (msec):
    min: 2797.9
    max: 5268.4
    median: 4614.4
    p95: 5214.5
    p99: 5250.9
  Codes:
    200: 842
  Errors:
    ESOCKETTIMEDOUT: 454

Report @ 22:36:29(+0300) 2021-06-16
Elapsed time: 14 minutes, 35 seconds
  Scenarios launched:  577
  Scenarios completed: 0
  Requests completed:  577
  Mean response/sec: 180.73
  Response time (msec):
    min: 196.3
    max: 5436.2
    median: 2260.7
    p95: 3772.8
    p99: 4712.9
  Codes:
    200: 577
  Errors:
    ESOCKETTIMEDOUT: 740

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:36:39(+0300) 2021-06-16
Elapsed time: 14 minutes, 45 seconds
  Scenarios launched:  911
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 91.84
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 1133

Report @ 22:36:49(+0300) 2021-06-16
Elapsed time: 14 minutes, 55 seconds
  Scenarios launched:  923
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 92.48
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 820

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:36:59(+0300) 2021-06-16
Elapsed time: 15 minutes, 5 seconds
  Scenarios launched:  769
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 76.9
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 821

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:37:09(+0300) 2021-06-16
Elapsed time: 15 minutes, 15 seconds
  Scenarios launched:  1063
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 106.41
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 932

Report @ 22:37:19(+0300) 2021-06-16
Elapsed time: 15 minutes, 25 seconds
  Scenarios launched:  672
  Scenarios completed: 0
  Requests completed:  417
  Mean response/sec: 66.57
  Response time (msec):
    min: 855.9
    max: 5069.2
    median: 3410
    p95: 4913.1
    p99: 5056.1
  Codes:
    200: 417
  Errors:
    ESOCKETTIMEDOUT: 796

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:37:29(+0300) 2021-06-16
Elapsed time: 15 minutes, 35 seconds
  Scenarios launched:  540
  Scenarios completed: 0
  Requests completed:  566
  Mean response/sec: 150.95
  Response time (msec):
    min: 41
    max: 5419.6
    median: 2858.8
    p95: 4387.1
    p99: 4988.3
  Codes:
    200: 566
  Errors:
    ESOCKETTIMEDOUT: 269

Report @ 22:37:39(+0300) 2021-06-16
Elapsed time: 15 minutes, 45 seconds
  Scenarios launched:  297
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 30.68
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 772

Report @ 22:37:49(+0300) 2021-06-16
Elapsed time: 15 minutes, 55 seconds
  Scenarios launched:  838
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 83.88
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 761

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:37:59(+0300) 2021-06-16
Elapsed time: 16 minutes, 5 seconds
  Scenarios launched:  988
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 99.1
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 742

Report @ 22:38:09(+0300) 2021-06-16
Elapsed time: 16 minutes, 15 seconds
  Scenarios launched:  392
  Scenarios completed: 0
  Requests completed:  713
  Mean response/sec: 90.31
  Response time (msec):
    min: 38.3
    max: 5028.3
    median: 1939.5
    p95: 4766.4
    p99: 4988.1
  Codes:
    200: 713
  Errors:
    ESOCKETTIMEDOUT: 330

Report @ 22:38:19(+0300) 2021-06-16
Elapsed time: 16 minutes, 25 seconds
  Scenarios launched:  627
  Scenarios completed: 0
  Requests completed:  143
  Mean response/sec: 96.9
  Response time (msec):
    min: 2971.7
    max: 6237.1
    median: 3625.2
    p95: 6203.5
    p99: 6232.8
  Codes:
    200: 143
  Errors:
    ESOCKETTIMEDOUT: 729

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:38:29(+0300) 2021-06-16
Elapsed time: 16 minutes, 36 seconds
  Scenarios launched:  848
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 82.36
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 819

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:38:39(+0300) 2021-06-16
Elapsed time: 16 minutes, 46 seconds
  Scenarios launched:  682
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 70.7
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 862

Report @ 22:38:49(+0300) 2021-06-16
Elapsed time: 16 minutes, 56 seconds
  Scenarios launched:  574
  Scenarios completed: 0
  Requests completed:  839
  Mean response/sec: 94.22
  Response time (msec):
    min: 270
    max: 5445.3
    median: 4290.4
    p95: 5324.4
    p99: 5391.2
  Codes:
    200: 839
  Errors:
    ESOCKETTIMEDOUT: 314

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:38:59(+0300) 2021-06-16
Elapsed time: 17 minutes, 6 seconds
  Scenarios launched:  744
  Scenarios completed: 0
  Requests completed:  334
  Mean response/sec: 156.31
  Response time (msec):
    min: 331.2
    max: 5849
    median: 1706
    p95: 3121.7
    p99: 5846.6
  Codes:
    200: 334
  Errors:
    ESOCKETTIMEDOUT: 980

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:39:10(+0300) 2021-06-16
Elapsed time: 17 minutes, 16 seconds
  Scenarios launched:  956
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 94.94
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 765

Report @ 22:39:20(+0300) 2021-06-16
Elapsed time: 17 minutes, 26 seconds
  Scenarios launched:  729
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 75.88
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 942

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:39:30(+0300) 2021-06-16
Elapsed time: 17 minutes, 36 seconds
  Scenarios launched:  1012
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 98.16
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN
  Errors:
    ESOCKETTIMEDOUT: 805

Warning: High CPU usage warning (pids: 18692).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 22:39:40(+0300) 2021-06-16
Elapsed time: 17 minutes, 46 seconds
  Scenarios launched:  758
  Scenarios completed: 0
  Requests completed:  625
  Mean response/sec: 94.39
  Response time (msec):
    min: 31.6
    max: 5089.2
    median: 3331
    p95: 4978.3
    p99: 5051.5
  Codes:
    200: 625
  Errors:
    ESOCKETTIMEDOUT: 703

Terminate batch job (Y/N)?